USE college_book_system;

INSERT INTO user (`name`, `password`) VALUES
  ('501123', 'fengshiyu'),
  ('501124', 'haochuanhuanran'),
  ('501125', 'xiongyingjia'),
  ('501126', 'yangwenjing'),
  ('501127', 'xiaxinyue'),
  ('501128', 'zhuguangyu'),
  ('501129', 'liuzhijie');

INSERT INTO book (`cover`, `title`, `description`) VALUES
  ('book1.png', '沉默的大多数',
   '这本杂文随笔集包括思想文化方面的文章，涉及知识分子的处境及思考，社会道德伦理，文化论争，国学与新儒家，民族主义等问题；包括从日常生活中发掘出来的各种真知灼见，涉及科学与邪道，女权主义等；包括对社会科学研究的评论，涉及性问题，生育问题，同性恋问题，社会研究的伦理问题和方法问题等；包括创作谈和文论，如写作的动机，作者的师承，作者对小说艺术的看法，作者对文体格调的看法，对影视的看法等；包括少量的书评，其中既有对文学经典的评论，也有对当代作家作品的一些看法；最后，还包括一些域外生活的杂感以及对某些社会现象的评点'),
  ('book2.png', '遥远的救世主',
   '这是一部可以傲然独尊的长篇小说。也是一部可遇不可求的完美佳作。作者以她的才华，探索一个有机的、无定形的、陌生的、暧昧的和未曾臻达的世界。男女主人公那浓墨重彩的经历以及令人欷歔的爱情故事创造出了一种超然背叛的意志，而这意志是那样的静谧、清明'),
  ('book3.png', '追风筝的人',
   '12岁的阿富汗富家少爷阿米尔与仆人哈桑情同手足。然而，在一场风筝比赛后，发生了一件悲惨不堪的事，阿米尔为自己的懦弱感到自责和痛苦，逼走了哈桑，不久，自己也跟随父亲逃往美国。成年后的阿米尔始终无法原谅自己当年对哈桑的背叛。为了赎罪，阿米尔再度踏上暌违二十多年的故乡，希望能为不幸的好友尽最后一点心力，却发现一个惊天谎言，儿时的噩梦再度重演，阿米尔该如何抉择？故事如此残忍而又美丽，作者以温暖细腻的笔法勾勒人性的本质与救赎，读来令人荡气回肠');

INSERT INTO comment (`book_id`, `thumb`, `content`, `creator`) VALUES
  (1, 10, '这本书很有意思', 'fengshiyu'),
  (1, 12, '这本书很有意思', 'haochuanhuanran'),
  (1, 13, '这本书很有意思', 'xiongyingjia'),
  (1, 14, '这本书很有意思', 'yangwenjing'),
  (1, 11, '这本书很有意思', 'xiaxinyue'),
  (1, 20, '这本书很有意思', 'liuzhijie'),
  (1, 20, '这本书很有意思', 'zhuguangyu'),
  (2, 10, '这本书很有意思', 'fengshiyu'),
  (2, 12, '这本书很有意思', 'haochuanhuanran'),
  (2, 13, '这本书很有意思', 'xiongyingjia'),
  (2, 14, '这本书很有意思', 'yangwenjing'),
  (2, 11, '这本书很有意思', 'xiaxinyue'),
  (2, 20, '这本书很有意思', 'liuzhijie'),
  (2, 20, '这本书很有意思', 'zhuguangyu'),
  (3, 10, '这本书很有意思', 'fengshiyu'),
  (3, 12, '这本书很有意思', 'haochuanhuanran'),
  (3, 13, '这本书很有意思', 'xiongyingjia'),
  (3, 14, '这本书很有意思', 'yangwenjing'),
  (3, 11, '这本书很有意思', 'xiaxinyue'),
  (3, 20, '这本书很有意思', 'liuzhijie'),
  (3, 20, '这本书很有意思', 'zhuguangyu');